# Exploratory Data Analysis

## SQL

In [5]:
import pandas as pd

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Establish a connection to the data base before you run the following cell:
Create a text file called **.env** containing

> PGSQL_USER=USERNAME  \
> PGSQL_PASSWORD= PASSWORD 

**Note:** I (Cannur) created .env file with my credentials so you do not need to create it. You can run it directly.

In [2]:
from dotenv import load_dotenv
import os

load_dotenv()
username = os.getenv('PGSQL_USER')
password = os.getenv('PGSQL_PASSWORD')
hostname = 'gip.itc.utwente.nl'
portname = '5434'
databasename = 'c211'

%sql postgresql://{username}:{password}@{hostname}:{portname}/{databasename}

Now, we can find the database has how many rows.

In [3]:
%sql \
select count(*) as Row_Counts\
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(2530161,)]

Now, we can see the 3 rows from our table.

In [4]:
%%sql 
Select * from vw_observation2017
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(1755950, '441', '5639', datetime.date(2017, 3, 18), 36552, 227, 618, '15:28', 33989999),
 (1457662, '619', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '16:23', 33990000),
 (1457664, '70', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '15:44', 33990004)]

We can check the null cells.

In [16]:
%%sql 
select count(*) 
from vw_observation2017 
where id isnull or 
 species isnull or 
 observer isnull or
 obsdate isnull or 
 block isnull or 
 longit isnull or
 latit isnull or
 obstime isnull or
 idd isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

We can check the just obstime column to see null cells. And all null cells in the table from obstime. In this case, we will not use the obstime as a variable for the observer intensity, so we do not want to delete this null value to not loss the observation data.

In [17]:
%%sql 
select count(*) 
from vw_observation2017 
where obstime isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

In [21]:
%%sql 
select *
from vw_observation2017 
where obstime isnull
Limit 5

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5 rows affected.

[(1910382, '50', '8724', datetime.date(2017, 4, 18), 32670, 208, 566, None, 36539480),
 (3360295, '42', '3661', datetime.date(2017, 1, 4), 9425, 111, 431, None, 36561194),
 (2684416, '622', '652', datetime.date(2017, 5, 21), 17651, 148, 492, None, 36567158),
 (1734327, '37', '5437', datetime.date(2017, 5, 21), 37308, 231, 574, None, 36580496),
 (3633157, '9', '28762', datetime.date(2017, 2, 18), 6869, 97, 443, None, 36585627)]

We can check the dublicated data for observation data. We assumed if the *species*, *observer*, *obsdate*, and *block* are the same for the different rows, they are **dublicated**. In the below, if the *dublicatecount* is bigger than 1, that rows should delete.

In [12]:
%%sql 
With CTE As
(Select species, observer, obsdate, block, Row_Number() Over (Partition by 
                                                              species, observer, obsdate, block 
                                                              Order by id) 
 As DublicateCount 
from vw_observation2017)
Select *
from CTE
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[('10', '10005', datetime.date(2017, 3, 10), 1707, 1),
 ('10', '10005', datetime.date(2017, 3, 10), 1707, 2),
 ('10', '10005', datetime.date(2017, 3, 10), 1857, 1)]

We can see how many dublicated rows.

In [13]:
%%sql
With CTE As
(Select species, observer, obsdate, block, Row_Number() Over (Partition by 
                                                              species, observer, obsdate, block 
                                                              Order by id) 
 As DublicateCount 
from vw_observation2017)
Select count(*)
from CTE
where DublicateCount>1

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(212582,)]

Now we can create a new view table *vw_observation2017_nodublicate* by select just 1 row from dublicated rows. Anymore, we do not have dublicated rows. If you try to run it, you will get an error because it is already created.

In [16]:
%%sql
CREATE VIEW vw_observation2017_nodublicate AS
With CTE As
(Select species, observer, obsdate, block, Row_Number() Over (Partition by 
                                                              species, observer, obsdate, block 
                                                              Order by id) 
 As DublicateCount 
from vw_observation2017)
Select *
from CTE
where DublicateCount=1

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

We can see the 3 rows for the other tables.

In [6]:
%%sql 
Select * from vw_myblocklanduse
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'Hoofdweg', 1, 6537.33085031952),
 (60, 'Landbouw', 1, 871977.654549437),
 (60, 'Recreatie', 1, 39618.6174416008)]

In [8]:
%%sql 
Select * from precipitation
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(48471, 20170322, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170323, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170324, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313)]

In [9]:
%%sql 
Select * from temperature
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(21944, 20170424, 51.2509, 3.80463, 15.0413, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170425, 51.2509, 3.80463, 10.3514, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170614, 51.2509, 3.80463, 26.1349, '0101000020407100009634E9AF99BCE540883057F634311641', 1439)]

In [10]:
%%sql 
Select * from block_demography
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(167, 18, 375, '0103000020407100000100000005000000000000000094D1400000000060E31641000000000094D1400000000000F3164100000000008ED2400000000000F3164100000000008ED2400000000060E31641000000000094D1400000000060E31641', 5, 115, 1005, 1755, 4275, 8715, 9390, 9565),
 (168, 18, 376, '0103000020407100000100000005000000000000000094D1400000000000F31641000000000094D14000000000A002174100000000008ED24000000000A002174100000000008ED2400000000000F31641000000000094D1400000000000F31641', 10, 450, 1070, 1725, 3885, 6915, 9220, 9525),
 (169, 18, 377, '0103000020407100000100000005000000000000000094D14000000000A0021741000000000094D140000000004012174100000000008ED240000000004012174100000000008ED24000000000A0021741000000000094D14000000000A0021741', 0, 475, 625, 1660, 1885, 6515, 7420, 9345)]

In [20]:
%%sql 
Select * from block_road_access
Limit 5

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5 rows affected.

[(60, 'W', 1, 900.48733374501),
 (61, 'W', 1, 1656.38376965095),
 (62, 'G', 1, 656.363163271632),
 (62, 'P', 1, 1187.96007576262),
 (62, 'W', 1, 3335.78142596005)]

In [12]:
%%sql 
Select * from days
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(20170102, datetime.date(2017, 1, 2), 2, 1, False),
 (20170103, datetime.date(2017, 1, 3), 3, 2, False),
 (20170104, datetime.date(2017, 1, 4), 4, 3, False)]

We can find: 
- how many observer, 
- different species and 
- different blocks.

In [17]:
%%sql 
Select count(distinct observer) as Number_of_Observer
from vw_observation2017_nodublicate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(11805,)]

In [18]:
%%sql 
Select count(distinct species) as Number_of_Species
from vw_observation2017_nodublicate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(464,)]

In [19]:
%%sql 
Select count(distinct block) as Number_of_block
from vw_observation2017_nodublicate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(33535,)]

Now we create new table for roadlength from *block_road_access*. Because one block has several roadlenght according to maintainer. In our project, we assume maintainers have not a big affect on observer intensity. So, roadlenghts for different maintainers for per block were summed. The new roadlenght table name is **"roadlenght"**.

In [34]:
%%sql 
CREATE VIEW roadlength(block, roadlength) AS SELECT block, SUM(roadlength) 
FROM block_road_access 
WHERE block=block
GROUP BY block

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

I try to fix code in the below.

In [34]:
%%sql 
CREATE VIEW vw_days AS SELECT * 
FROM days 
ALTER TABLE vw_days
add weekdays int
UPDATE vw_days
set workingdays = 1
where dow = 1 and dow = 2 and dow = 3 and dow = 4 and dow = 5 and natholiday = 'False'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

********************************Later section will change. Dont care it*******************************

Our primary table is *vw_observation2017*. Now, we can merge it with *days* table. And then we can get the day of week, day of weekend and national holiday data. In this case, we use the ***Left Join*** function because, we do not want to loss our observation data. Everytime, the rows from *vw_observation2017* table stay same. If the another table do not have matching data, for these columns tha value assign *null*. 

**Note:** To use the merged tables, we create it as a view table. Otherwise the database do not have the file and we can not use it in the next step. When you run this code you will get error because of the dublication. It means, it is already exists in our database. So no problem.

In [39]:
%%sql 
CREATE VIEW merged_1 AS SELECT * 
FROM vw_observation2017 LEFT JOIN days ON vw_observation2017.obsdate = days.odate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

We can merge the other related tables with *merged_1*. We added precipitation, temperature, population and roadlenght data.

In [40]:
%%sql 
CREATE VIEW merged_2 AS 
SELECT merged_1.*, 
precipitation.dtime, precipitation.precip, 
temperature.temper, 
block_demography.geom, block_demography.pop001, block_demography.pop009, block_demography.pop025, block_demography.pop049, block_demography.pop081, block_demography.pop121, block_demography.pop169, block_demography.pop225, 
roadlength.roadlength
FROM merged_1 
LEFT JOIN precipitation ON merged_1.mdate = precipitation.dtime and merged_1.block = precipitation.block 
LEFT JOIN temperature ON merged_1.mdate = temperature.dtime and merged_1.block = temperature.block 
LEFT JOIN block_demography ON merged_1.block = block_demography.block
LEFT JOIN roadlength ON merged_1.block = roadlength.block

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

Now we can see what we did until here. We can see our merged table with only 3 rows.

In [41]:
%%sql 
Select * from merged_2
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(1434136, '144', '27569', datetime.date(2017, 5, 26), 43630, 186, 319, '20:38', 37169153, 20170526, datetime.date(2017, 5, 26), 146, 5, False, 20170526, 0.0, 27.0172, '01030000204071000001000000050000000000000080B4064100000000607813410000000080B40641000000000088134100000000C0D30641000000000088134100000000C0D3064100000000607813410000000080B406410000000060781341', 3165, 7675, 11485, 20630, 31390, 47420, 67935, 113685, 14478.1891515458),
 (1434137, '401', '27569', datetime.date(2017, 5, 26), 43630, 186, 319, '20:37', 37169100, 20170526, datetime.date(2017, 5, 26), 146, 5, False, 20170526, 0.0, 27.0172, '01030000204071000001000000050000000000000080B4064100000000607813410000000080B40641000000000088134100000000C0D30641000000000088134100000000C0D3064100000000607813410000000080B406410000000060781341', 3165, 7675, 11485, 20630, 31390, 47420, 67935, 113685, 14478.1891515458),
 (1434139, '501', '27569', datetime.date(2017, 5, 26), 43630, 186, 319, '20:38', 37169089, 20170526, datetime.date(2017, 5, 26), 146, 5, False, 20170526, 0.0, 27.0172, '01030000204071000001000000050000000000000080B4064100000000607813410000000080B40641000000000088134100000000C0D30641000000000088134100000000C0D3064100000000607813410000000080B406410000000060781341', 3165, 7675, 11485, 20630, 31390, 47420, 67935, 113685, 14478.1891515458)]

Now we need the landuse data and nature reserve. But it is a little complex. So firstly we should decide how we can fix them and later we can merge them.